<?php       //периметр четырехугольника 
    $a = 5; // сторона четырехугольника
    $b = 3; // сторона четырехугольника
    $c = 5; // сторона четырехугольника
    $d = 12; // сторона четырехугольника

    $perimetr = $a + $b + $c + $d; // расчет периметра четырехуголника

    echo "периметр четырехугольника равен: $perimetr см <hr/>"; // вывод на экран результат
  
   // значение S
    $x = 0.5; // значение х
    $a1 = 7 * $x; // находим значение а
    $b2 = 21 * $x; // находим значение b
    $s = ($a1 + $b2) ** 2; // вычисляем значение s

    echo "Значение S = $s<hr/>"; // выводим значение на экран
  ?>
